#!/usr/bin/env sh

### Script: regex_escape.sh
##
## 正規表現をエスケープする関数を定義する。
##
## Metadata:
##
##   id - 54eb1b25-f085-4489-8b71-f37107caa7d7
##   author - <qq542vev at https://purl.org/meta/me/>
##   version - 1.0.0
##   date - 2022-09-02
##   since - 2022-07-26
##   copyright - Copyright (C) 2022-2022 qq542vev. Some rights reserved.
##   license - <CC-BY at https://creativecommons.org/licenses/by/4.0/>
##   package - w3mplus
##
## See Also:
##
##   * <Project homepage at https://github.com/qq542vev/w3mplus>
##   * <Bag report at https://github.com/qq542vev/w3mplus/issues>

### Function: regex_escape
##
## 正規表現文字列をエスケープする。
##
## Parameters:
##
##   $1 - 結果を代入する変数名。
##   $2 - エスケープする文字列。
##   $3 - エスケープする正規表現の種類。
##
## Returns:
##
##   エスケープされた文字列。

regex_escape() {
	set -- "${1}" "${2}" "${3-}" ''
	until [ "${2#*'\'}" = "${2}" ]; do
		set -- "${1}" "${2#*'\'}" "${3-}" "${4}${2%%'\'*}\\\\"
	done

	set -- "${1}" "${4}${2}" "${3-}" ''
	until [ "${2#*'['}" = "${2}" ]; do
		set -- "${1}" "${2#*'['}" "${3-}" "${4}${2%%'['*}\\["
	done

	set -- "${1}" "${4}${2}" "${3-}" ''
	until [ "${2#*'.'}" = "${2}" ]; do
		set -- "${1}" "${2#*'.'}" "${3-}" "${4}${2%%'.'*}\\."
	done

	set -- "${1}" "${4}${2}" "${3-}" ''
	until [ "${2#*'*'}" = "${2}" ]; do
		set -- "${1}" "${2#*'*'}" "${3-}" "${4}${2%%'*'*}\\*"
	done

	set -- "${1}" "${4}${2}" "${3-}" ''
	until [ "${2#*'^'}" = "${2}" ]; do
		set -- "${1}" "${2#*'^'}" "${3-}" "${4}${2%%'^'*}\\^"
	done

	set -- "${1}" "${4}${2}" "${3-}" ''
	until [ "${2#*'$'}" = "${2}" ]; do
		set -- "${1}" "${2#*'$'}" "${3-}" "${4}${2%%'$'*}\\$"
	done

	case "${3:-BRE}" in
		'ERE' | 'SED-ERE')
			set -- "${1}" "${4}${2}" "${3-}" ''
			until [ "${2#*'+'}" = "${2}" ]; do
				set -- "${1}" "${2#*'+'}" "${3-}" "${4}${2%%'+'*}\\+"
			done

			set -- "${1}" "${4}${2}" "${3-}" ''
			until [ "${2#*'?'}" = "${2}" ]; do
				set -- "${1}" "${2#*'?'}" "${3-}" "${4}${2%%'?'*}\\?"
			done

			set -- "${1}" "${4}${2}" "${3-}" ''
			until [ "${2#*'|'}" = "${2}" ]; do
				set -- "${1}" "${2#*'|'}" "${3-}" "${4}${2%%'|'*}\\|"
			done

			set -- "${1}" "${4}${2}" "${3-}" ''
			until [ "${2#*'('}" = "${2}" ]; do
				set -- "${1}" "${2#*'('}" "${3-}" "${4}${2%%'('*}\\("
			done

			set -- "${1}" "${4}${2}" "${3-}" ''
			until [ "${2#*')'}" = "${2}" ]; do
				set -- "${1}" "${2#*')'}" "${3-}" "${4}${2%%')'*}\\)"
			done

			set -- "${1}" "${4}${2}" "${3-}" ''
			until [ "${2#*'{'}" = "${2}" ]; do
				set -- "${1}" "${2#*'{'}" "${3-}" "${4}${2%%'{'*}\\{"
			done
			;;
	esac

	case "${3:-BRE}" in
		'SED-BRE' | 'SED-ERE')
			set -- "${1}" "${4}${2}" "${3-}" ''
			until [ "${2#*'/'}" = "${2}" ]; do
				set -- "${1}" "${2#*'/'}" "${3-}" "${4}${2%%'/'*}\\/"
			done
			;;
	esac

	eval "${1}=\"\${4}\${2}\""
}
